<?php
// +----------------------------------------------------------------------
// | ThinkPHP [ WE CAN DO IT JUST THINK ]
// +----------------------------------------------------------------------
// | Copyright (c) 2006~2018 http://thinkphp.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: liu21st <liu21st@gmail.com>
// +----------------------------------------------------------------------

// +----------------------------------------------------------------------
// | 缓存设置
// +----------------------------------------------------------------------

return [
    // 驱动方式
    'type'   => 'complex',
//    'default' => [
//        // 驱动方式
//        'type' => 'File',
//        // 缓存保存目录
//        'path' => CACHE_PATH,
//    ],
    // 文件缓存
    'file' => [
        // 驱动方式
        'type' => 'file',
        // 设置不同的缓存保存目录
        'path' => ''
    ],
    // redis缓存
    'default' => [
        // 驱动方式
        'type' => 'redis',
        // 服务器地址
        'host' => Env::get('redis.host'), // 本地环境先开启redis服务端 redis-service.exe
        'port' => Env::get('redis.port'),
    ]
];
